# Estadística Aplicada
## Raúl Flores Robles 1838148
### 3ra Sesión

In [5]:
import numpy as np
import pandas as pd

In [26]:
alumno1 = ['Juan','Lopez',23]
alumno2 = ['Raul','Lopez',15]
alumno3 = ['John','Lara',18]
alumno4 = ['Xime','Lira',22]
alumno5 = ['Ale','Lugo',26]

In [29]:
estadistica = [alumno1,alumno2,alumno3,alumno4,alumno5]

In [30]:
estadistica = pd.DataFrame(estadistica,columns=['Nombre','Apellido','Edad'])
estadistica

  Nombre Apellido  Edad
0   Juan    Lopez    23
1   Raul    Lopez    15
2   John     Lara    18
3   Xime     Lira    22
4    Ale     Lugo    26

In [31]:
estadistica.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [32]:
estadistica.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
estadistica.shape

(5, 3)

In [36]:
estadistica.describe()

           Edad
count   5.00000
mean   20.80000
std     4.32435
min    15.00000
25%    18.00000
50%    22.00000
75%    23.00000
max    26.00000

In [37]:
estadistica['Edad en días'] = estadistica['Edad']*365

In [38]:
estadistica

  Nombre Apellido  Edad  Edad en días
0   Juan    Lopez    23          8395
1   Raul    Lopez    15          5475
2   John     Lara    18          6570
3   Xime     Lira    22          8030
4    Ale     Lugo    26          9490

In [39]:
estadistica['Origen'] = ['Apodaca','San Pedro','Guadalupe','Salinas','Cadereyta']

In [40]:
estadistica

  Nombre Apellido  Edad  Edad en días     Origen
0   Juan    Lopez    23          8395    Apodaca
1   Raul    Lopez    15          5475  San Pedro
2   John     Lara    18          6570  Guadalupe
3   Xime     Lira    22          8030    Salinas
4    Ale     Lugo    26          9490  Cadereyta

In [41]:
estadistica['Edad'].mean()

20.8

In [42]:
round(estadistica['Edad'].std(ddof=1),2)

4.32

In [43]:
estadistica.dtypes

Nombre          object
Apellido        object
Edad             int64
Edad en días     int64
Origen          object
dtype: object

In [44]:
estadistica.count()

Nombre          5
Apellido        5
Edad            5
Edad en días    5
Origen          5
dtype: int64

In [45]:
estadistica.sort_values('Apellido',ascending=True)

  Nombre Apellido  Edad  Edad en días     Origen
2   John     Lara    18          6570  Guadalupe
3   Xime     Lira    22          8030    Salinas
0   Juan    Lopez    23          8395    Apodaca
1   Raul    Lopez    15          5475  San Pedro
4    Ale     Lugo    26          9490  Cadereyta

In [46]:
estadistica.sort_values(['Apellido','Nombre'],ascending=[True,True])

  Nombre Apellido  Edad  Edad en días     Origen
2   John     Lara    18          6570  Guadalupe
3   Xime     Lira    22          8030    Salinas
0   Juan    Lopez    23          8395    Apodaca
1   Raul    Lopez    15          5475  San Pedro
4    Ale     Lugo    26          9490  Cadereyta